apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PA10_FUNC_CTL function mux definitions */
#define IOC_PA10_FUNC_CTL_GPIO_A_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA10_FUNC_CTL_GPTMR0_COMP_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA10_FUNC_CTL_UART7_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PA10_FUNC_CTL_I2C1_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA10_FUNC_CTL_CAN3_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PA10_FUNC_CTL_I2S1_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PA10_FUNC_CTL_DAOL_N               IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PA10_FUNC_CTL_CAM0_XCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PA11_FUNC_CTL function mux definitions */
#define IOC_PA11_FUNC_CTL_GPIO_A_11            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA11_FUNC_CTL_GPTMR0_COMP_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA11_FUNC_CTL_UART7_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PA11_FUNC_CTL_I2C1_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA11_FUNC_CTL_CAN2_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PA11_FUNC_CTL_I2S1_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PA11_FUNC_CTL_DAOR_N               IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PA11_FUNC_CTL_CAM0_PIXCLK          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PA12_FUNC_CTL function mux definitions */
#define IOC_PA12_FUNC_CTL_GPIO_A_12            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA12_FUNC_CTL_GPTMR1_CAPT_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA12_FUNC_CTL_UART9_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA12_FUNC_CTL_I2C3_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA12_FUNC_CTL_SPI1_DAT3            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PA12_FUNC_CTL_I2S1_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA12_FUNC_CTL_DIS0_B_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PA12_FUNC_CTL_CAM0_PIXCLK          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PA13_FUNC_CTL function mux definitions */
#define IOC_PA13_FUNC_CTL_GPIO_A_13            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA13_FUNC_CTL_GPTMR1_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA13_FUNC_CTL_UART9_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA13_FUNC_CTL_I2C3_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA13_FUNC_CTL_SPI1_DAT2            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PA13_FUNC_CTL_I2S1_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA13_FUNC_CTL_DIS0_B_6             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PA13_FUNC_CTL_CAM0_HSYNC           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PA14_FUNC_CTL function mux definitions */
#define IOC_PA14_FUNC_CTL_GPIO_A_14            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA14_FUNC_CTL_GPTMR0_CAPT_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA14_FUNC_CTL_UART8_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA14_FUNC_CTL_I2C2_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA14_FUNC_CTL_CAN1_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PA14_FUNC_CTL_I2S2_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PA14_FUNC_CTL_I2S1_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA14_FUNC_CTL_DIS0_VSYNC           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)

/* IOC_PA15_FUNC_CTL function mux definitions */
#define IOC_PA15_FUNC_CTL_GPIO_A_15            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA15_FUNC_CTL_GPTMR0_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA15_FUNC_CTL_UART8_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PA15_FUNC_CTL_UART8_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA15_FUNC_CTL_I2C2_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA15_FUNC_CTL_CAN0_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PA15_FUNC_CTL_I2S2_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PA15_FUNC_CTL_I2S1_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA15_FUNC_CTL_DIS0_EN              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)

/* IOC_PA16_FUNC_CTL function mux definitions */
#define IOC_PA16_FUNC_CTL_GPIO_A_16            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA16_FUNC_CTL_GPTMR1_CAPT_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA16_FUNC_CTL_UART10_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA16_FUNC_CTL_SPI1_MOSI            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PA16_FUNC_CTL_CAN0_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PA16_FUNC_CTL_I2S1_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA16_FUNC_CTL_DIS0_B_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PA16_FUNC_CTL_CAM0_XCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PA17_FUNC_CTL function mux definitions */
#define IOC_PA17_FUNC_CTL_GPIO_A_17            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA17_FUNC_CTL_GPTMR1_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PA17_FUNC_CTL_UART10_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PA17_FUNC_CTL_UART10_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA17_FUNC_CTL_CAN0_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PA17_FUNC_CTL_I2S1_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA17_FUNC_CTL_DIS0_B_5             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PA17_FUNC_CTL_CAM0_VSYNC           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PA18_FUNC_CTL function mux definitions */
#define IOC_PA18_FUNC_CTL_GPIO_A_18            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA18_FUNC_CTL_UART10_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PA18_FUNC_CTL_SPI1_CSN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PA18_FUNC_CTL_I2S1_BCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA18_FUNC_CTL_DIS0_B_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PA18_FUNC_CTL_CAM0_D_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

