apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PA31_FUNC_CTL function mux definitions */
#define IOC_PA31_FUNC_CTL_GPIO_A_31            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PA31_FUNC_CTL_UART13_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PA31_FUNC_CTL_I2C1_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PA31_FUNC_CTL_SPI2_MISO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PA31_FUNC_CTL_I2S3_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PA31_FUNC_CTL_PWM0_P_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PA31_FUNC_CTL_DIS0_R_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)

/* IOC_PB00_FUNC_CTL function mux definitions */
#define IOC_PB00_FUNC_CTL_GPIO_B_00            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB00_FUNC_CTL_UART13_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB00_FUNC_CTL_UART13_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB00_FUNC_CTL_I2C1_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB00_FUNC_CTL_SPI2_SCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PB00_FUNC_CTL_I2S3_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB00_FUNC_CTL_PWM0_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB00_FUNC_CTL_DIS0_R_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)

/* IOC_PB01_FUNC_CTL function mux definitions */
#define IOC_PB01_FUNC_CTL_GPIO_B_01            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB01_FUNC_CTL_UART14_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB01_FUNC_CTL_I2S2_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB01_FUNC_CTL_I2S3_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB01_FUNC_CTL_PWM1_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB01_FUNC_CTL_DIS0_G_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB01_FUNC_CTL_SYSCTL_CLK_OBS_1     IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PB02_FUNC_CTL function mux definitions */
#define IOC_PB02_FUNC_CTL_GPIO_B_02            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB02_FUNC_CTL_UART14_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB02_FUNC_CTL_I2S2_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB02_FUNC_CTL_I2S3_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB02_FUNC_CTL_PWM1_P_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB02_FUNC_CTL_DIS0_B_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB02_FUNC_CTL_SYSCTL_CLK_OBS_0     IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PB03_FUNC_CTL function mux definitions */
#define IOC_PB03_FUNC_CTL_GPIO_B_03            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB03_FUNC_CTL_UART14_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB03_FUNC_CTL_I2C2_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB03_FUNC_CTL_I2S3_MCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB03_FUNC_CTL_TRGM0_P_11           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB03_FUNC_CTL_DIS0_R_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB03_FUNC_CTL_CAM1_D_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB04_FUNC_CTL function mux definitions */
#define IOC_PB04_FUNC_CTL_GPIO_B_04            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB04_FUNC_CTL_UART14_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB04_FUNC_CTL_UART14_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB04_FUNC_CTL_I2C2_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB04_FUNC_CTL_I2S3_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB04_FUNC_CTL_I2S2_FCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB04_FUNC_CTL_TRGM0_P_10           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB04_FUNC_CTL_DIS0_R_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB04_FUNC_CTL_CAM1_D_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB05_FUNC_CTL function mux definitions */
#define IOC_PB05_FUNC_CTL_GPIO_B_05            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB05_FUNC_CTL_UART13_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB05_FUNC_CTL_I2S3_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB05_FUNC_CTL_I2S2_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB05_FUNC_CTL_TRGM0_P_08           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB05_FUNC_CTL_DIS0_B_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB05_FUNC_CTL_CAM1_D_6             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB06_FUNC_CTL function mux definitions */
#define IOC_PB06_FUNC_CTL_GPIO_B_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB06_FUNC_CTL_UART15_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB06_FUNC_CTL_I2S3_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB06_FUNC_CTL_TRGM1_P_05           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB06_FUNC_CTL_DIS0_G_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB06_FUNC_CTL_CAM1_PIXCLK          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)
#define IOC_PB06_FUNC_CTL_SYSCTL_CLK_OBS_2     IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PB07_FUNC_CTL function mux definitions */
#define IOC_PB07_FUNC_CTL_GPIO_B_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB07_FUNC_CTL_UART15_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB07_FUNC_CTL_I2S3_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB07_FUNC_CTL_TRGM1_P_02           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB07_FUNC_CTL_DIS0_B_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(20)
#define IOC_PB07_FUNC_CTL_CAM1_HSYNC           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)
#define IOC_PB07_FUNC_CTL_SYSCTL_CLK_OBS_3     IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PB08_FUNC_CTL function mux definitions */
#define IOC_PB08_FUNC_CTL_GPIO_B_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB08_FUNC_CTL_UART2_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB08_FUNC_CTL_CAN2_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB08_FUNC_CTL_I2S3_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB08_FUNC_CTL_I2S2_BCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB08_FUNC_CTL_TRGM0_P_09           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB08_FUNC_CTL_CAM1_D_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB09_FUNC_CTL function mux definitions */
#define IOC_PB09_FUNC_CTL_GPIO_B_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB09_FUNC_CTL_UART2_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB09_FUNC_CTL_UART2_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB09_FUNC_CTL_CAN2_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB09_FUNC_CTL_I2S3_MCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB09_FUNC_CTL_I2S2_MCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB09_FUNC_CTL_TRGM0_P_07           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB09_FUNC_CTL_CAM1_D_5             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

