apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PB10_FUNC_CTL function mux definitions */
#define IOC_PB10_FUNC_CTL_GPIO_B_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB10_FUNC_CTL_UART12_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB10_FUNC_CTL_I2C0_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB10_FUNC_CTL_CAN3_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB10_FUNC_CTL_I2S3_BCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB10_FUNC_CTL_TRGM1_P_04           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB10_FUNC_CTL_CAM1_XCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB11_FUNC_CTL function mux definitions */
#define IOC_PB11_FUNC_CTL_GPIO_B_11            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB11_FUNC_CTL_UART12_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB11_FUNC_CTL_UART12_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB11_FUNC_CTL_I2C0_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB11_FUNC_CTL_CAN2_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB11_FUNC_CTL_I2S3_FCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB11_FUNC_CTL_TRGM1_P_01           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB11_FUNC_CTL_CAM1_VSYNC           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB12_FUNC_CTL function mux definitions */
#define IOC_PB12_FUNC_CTL_GPIO_B_12            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB12_FUNC_CTL_UART3_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB12_FUNC_CTL_UART3_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB12_FUNC_CTL_CAN3_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB12_FUNC_CTL_I2S3_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB12_FUNC_CTL_I2S2_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PB12_FUNC_CTL_TRGM0_P_06           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB12_FUNC_CTL_CAM1_D_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB13_FUNC_CTL function mux definitions */
#define IOC_PB13_FUNC_CTL_GPIO_B_13            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB13_FUNC_CTL_UART15_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB13_FUNC_CTL_I2C3_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB13_FUNC_CTL_CAN1_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB13_FUNC_CTL_I2S3_TXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB13_FUNC_CTL_TRGM1_P_03           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB13_FUNC_CTL_CAM1_D_8             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB14_FUNC_CTL function mux definitions */
#define IOC_PB14_FUNC_CTL_GPIO_B_14            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB14_FUNC_CTL_UART15_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB14_FUNC_CTL_UART15_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB14_FUNC_CTL_I2C3_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PB14_FUNC_CTL_CAN0_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB14_FUNC_CTL_I2S3_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PB14_FUNC_CTL_TRGM1_P_00           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB14_FUNC_CTL_CAM1_D_9             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(22)

/* IOC_PB15_FUNC_CTL function mux definitions */
#define IOC_PB15_FUNC_CTL_GPIO_B_15            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB15_FUNC_CTL_UART0_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB15_FUNC_CTL_UART0_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB15_FUNC_CTL_CAN0_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB15_FUNC_CTL_DAOR_P               IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PB15_FUNC_CTL_PWM0_FAULT_0         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PB15_FUNC_CTL_SOC_REF0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PB16_FUNC_CTL function mux definitions */
#define IOC_PB16_FUNC_CTL_GPIO_B_16            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB16_FUNC_CTL_UART0_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB16_FUNC_CTL_DAOR_N               IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PB16_FUNC_CTL_PWM1_FAULT_1         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PB17_FUNC_CTL function mux definitions */
#define IOC_PB17_FUNC_CTL_GPIO_B_17            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB17_FUNC_CTL_UART0_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB17_FUNC_CTL_CAN0_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB17_FUNC_CTL_DAOL_P               IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PB17_FUNC_CTL_PWM0_FAULT_1         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PB18_FUNC_CTL function mux definitions */
#define IOC_PB18_FUNC_CTL_GPIO_B_18            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB18_FUNC_CTL_UART1_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB18_FUNC_CTL_CAN1_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB18_FUNC_CTL_DAOL_N               IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PB18_FUNC_CTL_FEMC_DQ_25           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PB18_FUNC_CTL_PWM1_P_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PB19_FUNC_CTL function mux definitions */
#define IOC_PB19_FUNC_CTL_GPIO_B_19            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB19_FUNC_CTL_UART1_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB19_FUNC_CTL_UART1_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB19_FUNC_CTL_CAN1_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB19_FUNC_CTL_FEMC_DQ_24           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PB19_FUNC_CTL_PWM1_P_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PB20_FUNC_CTL function mux definitions */
#define IOC_PB20_FUNC_CTL_GPIO_B_20            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB20_FUNC_CTL_UART3_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PB20_FUNC_CTL_SPI2_DAT3            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PB20_FUNC_CTL_CAN3_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PB20_FUNC_CTL_FEMC_DQ_23           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PB20_FUNC_CTL_PWM0_P_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PB21_FUNC_CTL function mux definitions */
#define IOC_PB21_FUNC_CTL_GPIO_B_21            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB21_FUNC_CTL_UART2_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB21_FUNC_CTL_SPI2_SCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PB21_FUNC_CTL_FEMC_DQ_27           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PB21_FUNC_CTL_PWM1_P_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PB22_FUNC_CTL function mux definitions */
#define IOC_PB22_FUNC_CTL_GPIO_B_22            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PB22_FUNC_CTL_UART2_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PB22_FUNC_CTL_SPI2_MOSI            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PB22_FUNC_CTL_FEMC_DQ_26           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PB22_FUNC_CTL_PWM1_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

