apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PC06_FUNC_CTL function mux definitions */
#define IOC_PC06_FUNC_CTL_GPIO_C_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC06_FUNC_CTL_UART8_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC06_FUNC_CTL_FEMC_A_04            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC06_FUNC_CTL_XPI1_CB_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC06_FUNC_CTL_TRGM0_P_04           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC07_FUNC_CTL function mux definitions */
#define IOC_PC07_FUNC_CTL_GPIO_C_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC07_FUNC_CTL_UART8_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC07_FUNC_CTL_FEMC_A_05            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC07_FUNC_CTL_XPI1_CB_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC07_FUNC_CTL_TRGM0_P_02           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC08_FUNC_CTL function mux definitions */
#define IOC_PC08_FUNC_CTL_GPIO_C_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC08_FUNC_CTL_UART11_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC08_FUNC_CTL_FEMC_A_00            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC08_FUNC_CTL_TRGM1_P_10           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC08_FUNC_CTL_ETH1_EVTO_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC09_FUNC_CTL function mux definitions */
#define IOC_PC09_FUNC_CTL_GPIO_C_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC09_FUNC_CTL_UART11_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC09_FUNC_CTL_FEMC_A_01            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC09_FUNC_CTL_XPI1_CB_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC09_FUNC_CTL_TRGM1_P_08           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC09_FUNC_CTL_ETH1_EVTO_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC10_FUNC_CTL function mux definitions */
#define IOC_PC10_FUNC_CTL_GPIO_C_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC10_FUNC_CTL_UART6_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC10_FUNC_CTL_FEMC_A_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC10_FUNC_CTL_XPI1_CB_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC10_FUNC_CTL_TRGM1_P_07           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC11_FUNC_CTL function mux definitions */
#define IOC_PC11_FUNC_CTL_GPIO_C_11            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC11_FUNC_CTL_UART9_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC11_FUNC_CTL_FEMC_A_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC11_FUNC_CTL_XPI1_CB_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC11_FUNC_CTL_TRGM0_P_05           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC12_FUNC_CTL function mux definitions */
#define IOC_PC12_FUNC_CTL_GPIO_C_12            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC12_FUNC_CTL_UART9_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC12_FUNC_CTL_FEMC_A_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC12_FUNC_CTL_XPI1_CB_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC12_FUNC_CTL_TRGM0_P_01           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC13_FUNC_CTL function mux definitions */
#define IOC_PC13_FUNC_CTL_GPIO_C_13            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC13_FUNC_CTL_UART13_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC13_FUNC_CTL_FEMC_BA0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC13_FUNC_CTL_ETH1_EVTO_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC14_FUNC_CTL function mux definitions */
#define IOC_PC14_FUNC_CTL_GPIO_C_14            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC14_FUNC_CTL_UART13_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC14_FUNC_CTL_FEMC_BA1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC14_FUNC_CTL_XPI1_CB_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC14_FUNC_CTL_TRGM3_P_07           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC14_FUNC_CTL_ETH1_EVTO_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC15_FUNC_CTL function mux definitions */
#define IOC_PC15_FUNC_CTL_GPIO_C_15            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC15_FUNC_CTL_UART12_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC15_FUNC_CTL_FEMC_A_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC15_FUNC_CTL_XPI1_CB_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC15_FUNC_CTL_TRGM1_P_06           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC16_FUNC_CTL function mux definitions */
#define IOC_PC16_FUNC_CTL_GPIO_C_16            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC16_FUNC_CTL_UART14_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC16_FUNC_CTL_FEMC_DQS             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC16_FUNC_CTL_XPI1_CA_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC16_FUNC_CTL_TRGM2_P_02           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC17_FUNC_CTL function mux definitions */
#define IOC_PC17_FUNC_CTL_GPIO_C_17            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC17_FUNC_CTL_UART14_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC17_FUNC_CTL_FEMC_A_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC17_FUNC_CTL_XPI1_CA_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC17_FUNC_CTL_TRGM0_P_00           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC18_FUNC_CTL function mux definitions */
#define IOC_PC18_FUNC_CTL_GPIO_C_18            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC18_FUNC_CTL_UART1_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC18_FUNC_CTL_FEMC_RAS             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC18_FUNC_CTL_TRGM3_P_10           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC18_FUNC_CTL_ETH1_EVTI_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC19_FUNC_CTL function mux definitions */
#define IOC_PC19_FUNC_CTL_GPIO_C_19            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC19_FUNC_CTL_UART1_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC19_FUNC_CTL_FEMC_CS_0            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC19_FUNC_CTL_XPI1_CA_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC19_FUNC_CTL_TRGM3_P_08           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC19_FUNC_CTL_ETH1_EVTI_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

