apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PC20_FUNC_CTL function mux definitions */
#define IOC_PC20_FUNC_CTL_GPIO_C_20            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC20_FUNC_CTL_UART12_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC20_FUNC_CTL_FEMC_CS_1            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC20_FUNC_CTL_XPI1_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC20_FUNC_CTL_TRGM3_P_06           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC21_FUNC_CTL function mux definitions */
#define IOC_PC21_FUNC_CTL_GPIO_C_21            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC21_FUNC_CTL_UART15_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC21_FUNC_CTL_FEMC_A_11            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC21_FUNC_CTL_XPI1_CA_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC21_FUNC_CTL_TRGM2_P_03           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC22_FUNC_CTL function mux definitions */
#define IOC_PC22_FUNC_CTL_GPIO_C_22            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC22_FUNC_CTL_UART15_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC22_FUNC_CTL_FEMC_A_12            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC22_FUNC_CTL_XPI1_CA_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC22_FUNC_CTL_TRGM2_P_00           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC23_FUNC_CTL function mux definitions */
#define IOC_PC23_FUNC_CTL_GPIO_C_23            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC23_FUNC_CTL_UART2_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC23_FUNC_CTL_FEMC_CAS             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC23_FUNC_CTL_TRGM3_P_11           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC23_FUNC_CTL_ETH1_EVTI_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC24_FUNC_CTL function mux definitions */
#define IOC_PC24_FUNC_CTL_GPIO_C_24            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC24_FUNC_CTL_UART2_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC24_FUNC_CTL_FEMC_WE              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC24_FUNC_CTL_TRGM3_P_09           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC24_FUNC_CTL_ETH1_EVTI_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC25_FUNC_CTL function mux definitions */
#define IOC_PC25_FUNC_CTL_GPIO_C_25            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC25_FUNC_CTL_UART0_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC25_FUNC_CTL_FEMC_CKE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC25_FUNC_CTL_XPI1_CA_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC25_FUNC_CTL_TRGM2_P_04           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC26_FUNC_CTL function mux definitions */
#define IOC_PC26_FUNC_CTL_GPIO_C_26            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC26_FUNC_CTL_UART0_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC26_FUNC_CTL_FEMC_CLK             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC26_FUNC_CTL_XPI1_CA_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC26_FUNC_CTL_TRGM2_P_01           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC27_FUNC_CTL function mux definitions */
#define IOC_PC27_FUNC_CTL_GPIO_C_27            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC27_FUNC_CTL_UART6_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC27_FUNC_CTL_FEMC_DQ_05           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC27_FUNC_CTL_PWM3_P_5             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC27_FUNC_CTL_ETH1_EVTO_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC28_FUNC_CTL function mux definitions */
#define IOC_PC28_FUNC_CTL_GPIO_C_28            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC28_FUNC_CTL_UART6_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC28_FUNC_CTL_FEMC_DQ_06           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC28_FUNC_CTL_PWM3_P_6             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC28_FUNC_CTL_ETH1_EVTO_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC29_FUNC_CTL function mux definitions */
#define IOC_PC29_FUNC_CTL_GPIO_C_29            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC29_FUNC_CTL_UART7_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC29_FUNC_CTL_FEMC_DQ_07           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC29_FUNC_CTL_XPI1_CB_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC29_FUNC_CTL_PWM3_P_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PC29_FUNC_CTL_ETH1_EVTI_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PC30_FUNC_CTL function mux definitions */
#define IOC_PC30_FUNC_CTL_GPIO_C_30            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC30_FUNC_CTL_UART3_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC30_FUNC_CTL_FEMC_DM_0            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC30_FUNC_CTL_XPI1_CB_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC30_FUNC_CTL_TRGM2_P_05           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PC31_FUNC_CTL function mux definitions */
#define IOC_PC31_FUNC_CTL_GPIO_C_31            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PC31_FUNC_CTL_UART3_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PC31_FUNC_CTL_FEMC_DM_1            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PC31_FUNC_CTL_XPI1_CB_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PC31_FUNC_CTL_PWM2_FAULT_0         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD00_FUNC_CTL function mux definitions */
#define IOC_PD00_FUNC_CTL_GPIO_D_00            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD00_FUNC_CTL_UART4_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD00_FUNC_CTL_I2C0_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD00_FUNC_CTL_FEMC_DQ_02           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD00_FUNC_CTL_PWM3_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD00_FUNC_CTL_ETH1_EVTO_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD01_FUNC_CTL function mux definitions */
#define IOC_PD01_FUNC_CTL_GPIO_D_01            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD01_FUNC_CTL_UART4_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD01_FUNC_CTL_UART4_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD01_FUNC_CTL_I2C0_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD01_FUNC_CTL_FEMC_DQ_03           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD01_FUNC_CTL_PWM3_P_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD01_FUNC_CTL_ETH1_EVTO_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

