apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PD02_FUNC_CTL function mux definitions */
#define IOC_PD02_FUNC_CTL_GPIO_D_02            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD02_FUNC_CTL_UART7_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD02_FUNC_CTL_FEMC_DQ_04           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD02_FUNC_CTL_XPI1_CB_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD02_FUNC_CTL_PWM3_P_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD02_FUNC_CTL_ETH1_EVTI_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD03_FUNC_CTL function mux definitions */
#define IOC_PD03_FUNC_CTL_GPIO_D_03            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD03_FUNC_CTL_UART4_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD03_FUNC_CTL_FEMC_DQ_09           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD03_FUNC_CTL_XPI1_CB_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD03_FUNC_CTL_PWM2_P_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD04_FUNC_CTL function mux definitions */
#define IOC_PD04_FUNC_CTL_GPIO_D_04            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD04_FUNC_CTL_UART4_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD04_FUNC_CTL_FEMC_DQ_08           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD04_FUNC_CTL_XPI1_CB_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD04_FUNC_CTL_PWM2_P_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD05_FUNC_CTL function mux definitions */
#define IOC_PD05_FUNC_CTL_GPIO_D_05            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD05_FUNC_CTL_UART5_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD05_FUNC_CTL_UART5_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD05_FUNC_CTL_I2C1_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD05_FUNC_CTL_FEMC_DQ_01           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD05_FUNC_CTL_PWM3_P_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD05_FUNC_CTL_ETH1_EVTI_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD06_FUNC_CTL function mux definitions */
#define IOC_PD06_FUNC_CTL_GPIO_D_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD06_FUNC_CTL_UART5_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD06_FUNC_CTL_FEMC_DQ_11           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD06_FUNC_CTL_XPI1_CB_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD06_FUNC_CTL_PWM2_P_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD07_FUNC_CTL function mux definitions */
#define IOC_PD07_FUNC_CTL_GPIO_D_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD07_FUNC_CTL_UART5_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD07_FUNC_CTL_FEMC_DQ_10           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD07_FUNC_CTL_XPI1_CB_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD07_FUNC_CTL_PWM2_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD08_FUNC_CTL function mux definitions */
#define IOC_PD08_FUNC_CTL_GPIO_D_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD08_FUNC_CTL_UART5_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD08_FUNC_CTL_I2C1_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD08_FUNC_CTL_FEMC_DQ_00           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD08_FUNC_CTL_XPI1_CA_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD08_FUNC_CTL_PWM3_P_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD08_FUNC_CTL_ETH1_EVTI_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD09_FUNC_CTL function mux definitions */
#define IOC_PD09_FUNC_CTL_GPIO_D_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD09_FUNC_CTL_UART6_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD09_FUNC_CTL_I2C2_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD09_FUNC_CTL_CAN2_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD09_FUNC_CTL_FEMC_DQ_13           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD09_FUNC_CTL_XPI1_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD09_FUNC_CTL_PWM2_P_5             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD10_FUNC_CTL function mux definitions */
#define IOC_PD10_FUNC_CTL_GPIO_D_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD10_FUNC_CTL_UART6_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD10_FUNC_CTL_UART6_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD10_FUNC_CTL_I2C2_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD10_FUNC_CTL_CAN0_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD10_FUNC_CTL_FEMC_DQ_12           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD10_FUNC_CTL_XPI1_CA_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD10_FUNC_CTL_PWM2_P_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD11_FUNC_CTL function mux definitions */
#define IOC_PD11_FUNC_CTL_GPIO_D_11            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD11_FUNC_CTL_UART8_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD11_FUNC_CTL_CAN0_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD11_FUNC_CTL_XPI1_CA_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD11_FUNC_CTL_PWM3_FAULT_1         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD11_FUNC_CTL_ETH1_MDC             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD12_FUNC_CTL function mux definitions */
#define IOC_PD12_FUNC_CTL_GPIO_D_12            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD12_FUNC_CTL_UART7_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD12_FUNC_CTL_I2C3_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD12_FUNC_CTL_CAN3_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD12_FUNC_CTL_FEMC_DQ_15           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD12_FUNC_CTL_XPI1_CA_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD12_FUNC_CTL_PWM2_P_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD12_FUNC_CTL_ETH0_MDC             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD13_FUNC_CTL function mux definitions */
#define IOC_PD13_FUNC_CTL_GPIO_D_13            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD13_FUNC_CTL_UART7_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD13_FUNC_CTL_UART7_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD13_FUNC_CTL_I2C3_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PD13_FUNC_CTL_CAN1_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD13_FUNC_CTL_FEMC_DQ_14           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PD13_FUNC_CTL_XPI1_CA_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD13_FUNC_CTL_PWM2_P_6             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)

/* IOC_PD14_FUNC_CTL function mux definitions */
#define IOC_PD14_FUNC_CTL_GPIO_D_14            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD14_FUNC_CTL_UART8_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD14_FUNC_CTL_UART8_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD14_FUNC_CTL_CAN0_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD14_FUNC_CTL_XPI1_CA_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD14_FUNC_CTL_PWM3_FAULT_0         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD14_FUNC_CTL_ETH1_MDIO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD15_FUNC_CTL function mux definitions */
#define IOC_PD15_FUNC_CTL_GPIO_D_15            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD15_FUNC_CTL_UART8_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD15_FUNC_CTL_XPI1_CA_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD15_FUNC_CTL_PWM2_FAULT_1         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD15_FUNC_CTL_ETH0_MDIO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PD16_FUNC_CTL function mux definitions */
#define IOC_PD16_FUNC_CTL_GPIO_D_16            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD16_FUNC_CTL_UART9_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD16_FUNC_CTL_UART9_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD16_FUNC_CTL_CAN1_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD16_FUNC_CTL_TRGM2_P_06           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD16_FUNC_CTL_SDC1_DATA_4          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD16_FUNC_CTL_ETH1_TXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

