apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PD17_FUNC_CTL function mux definitions */
#define IOC_PD17_FUNC_CTL_GPIO_D_17            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD17_FUNC_CTL_UART11_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD17_FUNC_CTL_CAN3_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD17_FUNC_CTL_TRGM3_P_03           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD17_FUNC_CTL_SDC1_DATA_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD17_FUNC_CTL_ETH1_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD18_FUNC_CTL function mux definitions */
#define IOC_PD18_FUNC_CTL_GPIO_D_18            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD18_FUNC_CTL_UART11_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD18_FUNC_CTL_UART11_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD18_FUNC_CTL_CAN3_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD18_FUNC_CTL_TRGM3_P_00           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD18_FUNC_CTL_SDC1_DATA_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD18_FUNC_CTL_ETH1_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD19_FUNC_CTL function mux definitions */
#define IOC_PD19_FUNC_CTL_GPIO_D_19            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD19_FUNC_CTL_UART9_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD19_FUNC_CTL_SPI0_DAT2            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD19_FUNC_CTL_CAN1_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD19_FUNC_CTL_TRGM2_P_09           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD19_FUNC_CTL_SDC1_DATA_6          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD19_FUNC_CTL_ETH1_TXEN            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD20_FUNC_CTL function mux definitions */
#define IOC_PD20_FUNC_CTL_GPIO_D_20            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD20_FUNC_CTL_UART10_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD20_FUNC_CTL_UART10_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD20_FUNC_CTL_CAN2_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD20_FUNC_CTL_TRGM2_P_07           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD20_FUNC_CTL_SDC1_DS              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD20_FUNC_CTL_ETH1_TXCK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD21_FUNC_CTL function mux definitions */
#define IOC_PD21_FUNC_CTL_GPIO_D_21            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD21_FUNC_CTL_UART8_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD21_FUNC_CTL_SPI0_MOSI            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD21_FUNC_CTL_TRGM3_P_04           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD21_FUNC_CTL_SDC1_CMD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD21_FUNC_CTL_ETH1_RXDV            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD22_FUNC_CTL function mux definitions */
#define IOC_PD22_FUNC_CTL_GPIO_D_22            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD22_FUNC_CTL_UART8_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD22_FUNC_CTL_SPI0_CSN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD22_FUNC_CTL_TRGM3_P_01           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD22_FUNC_CTL_SDC1_CLK             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD22_FUNC_CTL_ETH1_RXCK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD23_FUNC_CTL function mux definitions */
#define IOC_PD23_FUNC_CTL_GPIO_D_23            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD23_FUNC_CTL_UART10_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD23_FUNC_CTL_TRGM2_P_11           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD23_FUNC_CTL_SDC1_RSTN            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD23_FUNC_CTL_ETH1_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD24_FUNC_CTL function mux definitions */
#define IOC_PD24_FUNC_CTL_GPIO_D_24            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD24_FUNC_CTL_UART10_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD24_FUNC_CTL_SPI0_DAT3            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD24_FUNC_CTL_TRGM2_P_10           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD24_FUNC_CTL_SDC1_DATA_7          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD24_FUNC_CTL_ETH1_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD25_FUNC_CTL function mux definitions */
#define IOC_PD25_FUNC_CTL_GPIO_D_25            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD25_FUNC_CTL_UART10_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PD25_FUNC_CTL_CAN2_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD25_FUNC_CTL_TRGM2_P_08           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD25_FUNC_CTL_SDC1_DATA_5          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD25_FUNC_CTL_ETH1_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD26_FUNC_CTL function mux definitions */
#define IOC_PD26_FUNC_CTL_GPIO_D_26            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD26_FUNC_CTL_UART9_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD26_FUNC_CTL_SPI0_MISO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD26_FUNC_CTL_TRGM3_P_05           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD26_FUNC_CTL_SDC1_DATA_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD26_FUNC_CTL_ETH1_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD27_FUNC_CTL function mux definitions */
#define IOC_PD27_FUNC_CTL_GPIO_D_27            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD27_FUNC_CTL_UART9_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD27_FUNC_CTL_SPI0_SCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD27_FUNC_CTL_TRGM3_P_02           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD27_FUNC_CTL_SDC1_DATA_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD27_FUNC_CTL_ETH1_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD28_FUNC_CTL function mux definitions */
#define IOC_PD28_FUNC_CTL_GPIO_D_28            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD28_FUNC_CTL_UART11_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD28_FUNC_CTL_XPI0_CA_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD28_FUNC_CTL_PWM2_P_5             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD28_FUNC_CTL_SDC1_CDN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD28_FUNC_CTL_ETH0_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD29_FUNC_CTL function mux definitions */
#define IOC_PD29_FUNC_CTL_GPIO_D_29            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD29_FUNC_CTL_UART11_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD29_FUNC_CTL_XPI0_CB_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD29_FUNC_CTL_PWM2_P_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD29_FUNC_CTL_SDC1_VSEL            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PD29_FUNC_CTL_ETH0_TXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PD30_FUNC_CTL function mux definitions */
#define IOC_PD30_FUNC_CTL_GPIO_D_30            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD30_FUNC_CTL_UART14_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD30_FUNC_CTL_SPI1_MISO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD30_FUNC_CTL_CAN0_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD30_FUNC_CTL_XPI0_CB_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD30_FUNC_CTL_PWM2_P_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD30_FUNC_CTL_ETH0_RXDV            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

