apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PD31_FUNC_CTL function mux definitions */
#define IOC_PD31_FUNC_CTL_GPIO_D_31            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PD31_FUNC_CTL_UART14_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PD31_FUNC_CTL_SPI1_SCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PD31_FUNC_CTL_CAN0_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PD31_FUNC_CTL_XPI0_CB_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PD31_FUNC_CTL_PWM2_P_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PD31_FUNC_CTL_ETH0_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE00_FUNC_CTL function mux definitions */
#define IOC_PE00_FUNC_CTL_GPIO_E_00            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE00_FUNC_CTL_UART12_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE00_FUNC_CTL_XPI0_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE00_FUNC_CTL_PWM2_P_6             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE00_FUNC_CTL_SDC1_WP              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE00_FUNC_CTL_ETH0_TXEN            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE01_FUNC_CTL function mux definitions */
#define IOC_PE01_FUNC_CTL_GPIO_E_01            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE01_FUNC_CTL_UART12_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE01_FUNC_CTL_XPI0_CB_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE01_FUNC_CTL_PWM2_P_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE01_FUNC_CTL_SDC0_CDN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE01_FUNC_CTL_ETH0_TXCK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE02_FUNC_CTL function mux definitions */
#define IOC_PE02_FUNC_CTL_GPIO_E_02            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE02_FUNC_CTL_UART13_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE02_FUNC_CTL_SPI1_DAT2            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PE02_FUNC_CTL_XPI0_CB_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE02_FUNC_CTL_PWM3_P_0             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE02_FUNC_CTL_ETH0_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE03_FUNC_CTL function mux definitions */
#define IOC_PE03_FUNC_CTL_GPIO_E_03            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE03_FUNC_CTL_UART15_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE03_FUNC_CTL_SPI1_CSN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PE03_FUNC_CTL_CAN1_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE03_FUNC_CTL_XPI0_CB_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE03_FUNC_CTL_PWM2_P_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE03_FUNC_CTL_ETH0_RXCK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE04_FUNC_CTL function mux definitions */
#define IOC_PE04_FUNC_CTL_GPIO_E_04            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE04_FUNC_CTL_UART15_TXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE04_FUNC_CTL_SPI1_MOSI            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PE04_FUNC_CTL_CAN1_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE04_FUNC_CTL_XPI0_CB_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE04_FUNC_CTL_PWM2_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE04_FUNC_CTL_ETH0_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE05_FUNC_CTL function mux definitions */
#define IOC_PE05_FUNC_CTL_GPIO_E_05            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE05_FUNC_CTL_UART13_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE05_FUNC_CTL_CAN3_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE05_FUNC_CTL_PWM3_P_4             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE05_FUNC_CTL_SDC0_WP              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE05_FUNC_CTL_ETH0_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE06_FUNC_CTL function mux definitions */
#define IOC_PE06_FUNC_CTL_GPIO_E_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE06_FUNC_CTL_UART13_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE06_FUNC_CTL_UART13_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE06_FUNC_CTL_CAN3_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE06_FUNC_CTL_PWM3_P_2             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE06_FUNC_CTL_SDC0_VSEL            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE06_FUNC_CTL_ETH0_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE07_FUNC_CTL function mux definitions */
#define IOC_PE07_FUNC_CTL_GPIO_E_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE07_FUNC_CTL_UART13_RXD           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE07_FUNC_CTL_SPI1_DAT3            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PE07_FUNC_CTL_XPI0_CB_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE07_FUNC_CTL_PWM3_P_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE07_FUNC_CTL_ETH0_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE08_FUNC_CTL function mux definitions */
#define IOC_PE08_FUNC_CTL_GPIO_E_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE08_FUNC_CTL_UART12_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE08_FUNC_CTL_CAN2_RXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE08_FUNC_CTL_XPI0_CA_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE08_FUNC_CTL_SDC0_DATA_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE08_FUNC_CTL_ETH0_MDC             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE09_FUNC_CTL function mux definitions */
#define IOC_PE09_FUNC_CTL_GPIO_E_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE09_FUNC_CTL_UART12_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE09_FUNC_CTL_UART12_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE09_FUNC_CTL_CAN2_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE09_FUNC_CTL_XPI0_CA_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE09_FUNC_CTL_SDC0_DATA_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE09_FUNC_CTL_ETH0_MDIO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE10_FUNC_CTL function mux definitions */
#define IOC_PE10_FUNC_CTL_GPIO_E_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE10_FUNC_CTL_UART15_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE10_FUNC_CTL_I2C1_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE10_FUNC_CTL_CAN0_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE10_FUNC_CTL_XPI0_CA_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE10_FUNC_CTL_SDC0_CMD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE10_FUNC_CTL_ETH1_MDC             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE11_FUNC_CTL function mux definitions */
#define IOC_PE11_FUNC_CTL_GPIO_E_11            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE11_FUNC_CTL_UART15_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE11_FUNC_CTL_UART15_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE11_FUNC_CTL_I2C1_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE11_FUNC_CTL_CAN1_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE11_FUNC_CTL_XPI0_CA_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE11_FUNC_CTL_SDC0_CLK             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE11_FUNC_CTL_ETH1_MDIO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE12_FUNC_CTL function mux definitions */
#define IOC_PE12_FUNC_CTL_GPIO_E_12            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE12_FUNC_CTL_UART0_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE12_FUNC_CTL_I2C2_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE12_FUNC_CTL_CAN2_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE12_FUNC_CTL_XPI0_CA_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE12_FUNC_CTL_SDC0_DATA_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

