apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PE13_FUNC_CTL function mux definitions */
#define IOC_PE13_FUNC_CTL_GPIO_E_13            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE13_FUNC_CTL_UART0_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE13_FUNC_CTL_I2C2_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE13_FUNC_CTL_CAN3_STBY            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE13_FUNC_CTL_XPI0_CA_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PE13_FUNC_CTL_SDC0_DATA_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

/* IOC_PE14_FUNC_CTL function mux definitions */
#define IOC_PE14_FUNC_CTL_GPIO_E_14            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE14_FUNC_CTL_GPTMR3_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE14_FUNC_CTL_UART14_CTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE14_FUNC_CTL_I2C0_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE14_FUNC_CTL_I2S0_TXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE14_FUNC_CTL_PWM3_P_5             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE14_FUNC_CTL_SDC1_WP              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE14_FUNC_CTL_ETH1_TXEN            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE14_FUNC_CTL_ETH0_EVTO_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE15_FUNC_CTL function mux definitions */
#define IOC_PE15_FUNC_CTL_GPIO_E_15            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE15_FUNC_CTL_UART14_DE            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE15_FUNC_CTL_UART14_RTS           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE15_FUNC_CTL_I2C0_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE15_FUNC_CTL_I2S0_TXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE15_FUNC_CTL_SDC1_CDN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE15_FUNC_CTL_ETH1_RXDV            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE15_FUNC_CTL_ETH0_EVTO_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE16_FUNC_CTL function mux definitions */
#define IOC_PE16_FUNC_CTL_GPIO_E_16            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE16_FUNC_CTL_GPTMR2_COMP_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE16_FUNC_CTL_UART2_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE16_FUNC_CTL_I2S0_MCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE16_FUNC_CTL_PWM3_P_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE16_FUNC_CTL_SDC1_VSEL            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE16_FUNC_CTL_ETH1_REFCLK          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE17_FUNC_CTL function mux definitions */
#define IOC_PE17_FUNC_CTL_GPIO_E_17            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE17_FUNC_CTL_GPTMR3_CAPT_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE17_FUNC_CTL_UART3_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE17_FUNC_CTL_I2S0_TXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE17_FUNC_CTL_PWM3_P_6             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE17_FUNC_CTL_SDC0_WP              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE17_FUNC_CTL_ETH1_TXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE17_FUNC_CTL_ETH0_EVTO_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE18_FUNC_CTL function mux definitions */
#define IOC_PE18_FUNC_CTL_GPIO_E_18            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE18_FUNC_CTL_GPTMR2_COMP_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE18_FUNC_CTL_UART3_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE18_FUNC_CTL_I2S0_FCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE18_FUNC_CTL_PWM3_P_7             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE18_FUNC_CTL_SDC0_CDN             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE18_FUNC_CTL_ETH1_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE18_FUNC_CTL_ETH0_EVTO_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE19_FUNC_CTL function mux definitions */
#define IOC_PE19_FUNC_CTL_GPIO_E_19            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE19_FUNC_CTL_GPTMR3_COMP_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE19_FUNC_CTL_UART4_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE19_FUNC_CTL_I2S0_RXD_3           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE19_FUNC_CTL_ACMP_COMP_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE19_FUNC_CTL_ETH1_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE19_FUNC_CTL_ETH0_EVTI_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE20_FUNC_CTL function mux definitions */
#define IOC_PE20_FUNC_CTL_GPIO_E_20            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE20_FUNC_CTL_UART4_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE20_FUNC_CTL_I2S0_BCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE20_FUNC_CTL_ACMP_COMP_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE20_FUNC_CTL_SDC0_VSEL            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE20_FUNC_CTL_ETH1_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE20_FUNC_CTL_ETH0_EVTI_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE21_FUNC_CTL function mux definitions */
#define IOC_PE21_FUNC_CTL_GPIO_E_21            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE21_FUNC_CTL_GPTMR4_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE21_FUNC_CTL_UART2_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE21_FUNC_CTL_I2S0_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE21_FUNC_CTL_PDM0_D_3             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PE21_FUNC_CTL_SDC0_DATA_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE21_FUNC_CTL_ETH0_RXDV            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

/* IOC_PE22_FUNC_CTL function mux definitions */
#define IOC_PE22_FUNC_CTL_GPIO_E_22            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE22_FUNC_CTL_GPTMR4_COMP_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE22_FUNC_CTL_UART1_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE22_FUNC_CTL_I2C3_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE22_FUNC_CTL_PDM0_D_1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PE22_FUNC_CTL_SDC0_CMD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE22_FUNC_CTL_ETH0_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE22_FUNC_CTL_ETH0_MDC             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE23_FUNC_CTL function mux definitions */
#define IOC_PE23_FUNC_CTL_GPIO_E_23            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE23_FUNC_CTL_GPTMR2_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE23_FUNC_CTL_UART1_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE23_FUNC_CTL_I2C3_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PE23_FUNC_CTL_PDM0_CLK             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PE23_FUNC_CTL_SDC0_DATA_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE23_FUNC_CTL_ETH0_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)
#define IOC_PE23_FUNC_CTL_ETH0_MDIO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE24_FUNC_CTL function mux definitions */
#define IOC_PE24_FUNC_CTL_GPIO_E_24            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE24_FUNC_CTL_GPTMR3_COMP_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE24_FUNC_CTL_UART5_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE24_FUNC_CTL_I2S0_RXD_2           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE24_FUNC_CTL_ACMP_COMP_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE24_FUNC_CTL_ETH0_EVTI_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)
#define IOC_PE24_FUNC_CTL_SOC_REF1             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PE25_FUNC_CTL function mux definitions */
#define IOC_PE25_FUNC_CTL_GPIO_E_25            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE25_FUNC_CTL_GPTMR4_CAPT_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PE25_FUNC_CTL_UART5_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE25_FUNC_CTL_I2S0_RXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE25_FUNC_CTL_ACMP_COMP_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(16)
#define IOC_PE25_FUNC_CTL_ETH0_EVTI_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)

/* IOC_PE26_FUNC_CTL function mux definitions */
#define IOC_PE26_FUNC_CTL_GPIO_E_26            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PE26_FUNC_CTL_UART1_DE             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PE26_FUNC_CTL_UART1_RTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PE26_FUNC_CTL_SPI2_DAT3            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PE26_FUNC_CTL_CAN3_TXD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(7)
#define IOC_PE26_FUNC_CTL_I2S0_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(8)
#define IOC_PE26_FUNC_CTL_SDC0_DATA_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PE26_FUNC_CTL_ETH0_TXEN            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(18)

