apache/nuttx/arch/risc-v/src/hpm6750/hpm6750_iomux.h
/* IOC_PF06_FUNC_CTL function mux definitions */
#define IOC_PF06_FUNC_CTL_GPIO_F_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PF06_FUNC_CTL_GPTMR5_CAPT_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PF06_FUNC_CTL_UART8_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PF06_FUNC_CTL_I2C2_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PF06_FUNC_CTL_SPI3_MISO            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PF06_FUNC_CTL_I2S0_BCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PF06_FUNC_CTL_ETH0_EVTO_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)
#define IOC_PF06_FUNC_CTL_USB1_PWR             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PF07_FUNC_CTL function mux definitions */
#define IOC_PF07_FUNC_CTL_GPIO_F_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PF07_FUNC_CTL_UART8_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PF07_FUNC_CTL_I2C2_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PF07_FUNC_CTL_SPI3_MOSI            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PF07_FUNC_CTL_I2S0_TXD_1           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PF07_FUNC_CTL_PDM0_CLK             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(10)
#define IOC_PF07_FUNC_CTL_USB1_ID              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PF08_FUNC_CTL function mux definitions */
#define IOC_PF08_FUNC_CTL_GPIO_F_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PF08_FUNC_CTL_GPTMR5_CAPT_0        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PF08_FUNC_CTL_UART2_CTS            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(3)
#define IOC_PF08_FUNC_CTL_I2C0_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PF08_FUNC_CTL_I2S0_RXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PF08_FUNC_CTL_ETH0_EVTO_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)
#define IOC_PF08_FUNC_CTL_USB0_OC              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PF09_FUNC_CTL function mux definitions */
#define IOC_PF09_FUNC_CTL_GPIO_F_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PF09_FUNC_CTL_GPTMR5_COMP_1        IOC_PAD_FUNC_CTL_ALT_SELECT_SET(1)
#define IOC_PF09_FUNC_CTL_UART9_RXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PF09_FUNC_CTL_I2C3_SDA             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PF09_FUNC_CTL_SPI3_DAT3            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PF09_FUNC_CTL_I2S0_FCLK            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PF09_FUNC_CTL_ETH0_EVTO_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(19)
#define IOC_PF09_FUNC_CTL_USB0_PWR             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PF10_FUNC_CTL function mux definitions */
#define IOC_PF10_FUNC_CTL_GPIO_F_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PF10_FUNC_CTL_UART9_TXD            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(2)
#define IOC_PF10_FUNC_CTL_I2C3_SCL             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(4)
#define IOC_PF10_FUNC_CTL_SPI3_DAT2            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(5)
#define IOC_PF10_FUNC_CTL_I2S0_TXD_0           IOC_PAD_FUNC_CTL_ALT_SELECT_SET(9)
#define IOC_PF10_FUNC_CTL_USB0_ID              IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PX00_FUNC_CTL function mux definitions */
#define IOC_PX00_FUNC_CTL_GPIO_X_00            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX00_FUNC_CTL_XPI0_CB_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX00_FUNC_CTL_SDC1_DATA_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

/* IOC_PX01_FUNC_CTL function mux definitions */
#define IOC_PX01_FUNC_CTL_GPIO_X_01            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX01_FUNC_CTL_FEMC_DQS             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PX01_FUNC_CTL_XPI0_CB_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX01_FUNC_CTL_SDC1_DATA_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

/* IOC_PX02_FUNC_CTL function mux definitions */
#define IOC_PX02_FUNC_CTL_GPIO_X_02            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX02_FUNC_CTL_XPI0_CA_D_2          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX02_FUNC_CTL_XPI0_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PX03_FUNC_CTL function mux definitions */
#define IOC_PX03_FUNC_CTL_GPIO_X_03            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX03_FUNC_CTL_XPI0_CA_D_3          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX03_FUNC_CTL_XPI1_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PX04_FUNC_CTL function mux definitions */
#define IOC_PX04_FUNC_CTL_GPIO_X_04            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX04_FUNC_CTL_XPI0_CA_CS1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX04_FUNC_CTL_SDC1_CMD             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)
#define IOC_PX04_FUNC_CTL_XPI1_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(24)

/* IOC_PX05_FUNC_CTL function mux definitions */
#define IOC_PX05_FUNC_CTL_GPIO_X_05            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX05_FUNC_CTL_XPI0_CA_DQS          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX05_FUNC_CTL_SDC1_CLK             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

/* IOC_PX06_FUNC_CTL function mux definitions */
#define IOC_PX06_FUNC_CTL_GPIO_X_06            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX06_FUNC_CTL_FEMC_DQS             IOC_PAD_FUNC_CTL_ALT_SELECT_SET(12)
#define IOC_PX06_FUNC_CTL_XPI0_CA_CS0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)

/* IOC_PX07_FUNC_CTL function mux definitions */
#define IOC_PX07_FUNC_CTL_GPIO_X_07            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX07_FUNC_CTL_XPI0_CA_SCLK         IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)

/* IOC_PX08_FUNC_CTL function mux definitions */
#define IOC_PX08_FUNC_CTL_GPIO_X_08            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX08_FUNC_CTL_XPI0_CB_D_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX08_FUNC_CTL_SDC1_DATA_1          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

/* IOC_PX09_FUNC_CTL function mux definitions */
#define IOC_PX09_FUNC_CTL_GPIO_X_09            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX09_FUNC_CTL_XPI0_CB_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)
#define IOC_PX09_FUNC_CTL_SDC1_DATA_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(17)

/* IOC_PX10_FUNC_CTL function mux definitions */
#define IOC_PX10_FUNC_CTL_GPIO_X_10            IOC_PAD_FUNC_CTL_ALT_SELECT_SET(0)
#define IOC_PX10_FUNC_CTL_XPI0_CA_D_0          IOC_PAD_FUNC_CTL_ALT_SELECT_SET(14)

